pages/15_Traverse_of_the_Cuillin_Ridge.html
<!DOCTYPE html>
<html xmlns="http://www.w3.org/1999/xhtml"
      xmlns:og="http://ogp.me/ns#"
      xmlns:fb="https://www.facebook.com/2008/fbml">
<head>
    <title>Traverse of the Cuillin Ridge.</title>
    <!-- Using the latest rendering mode for IE -->
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta charset="utf-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">

    <!-- Open Graph tags -->

            <meta property="og:type" content="article"/>
            <meta property="og:title" content="Traverse of the Cuillin Ridge."/>
            <meta property="og:url" content="http://thecastle.github.io/thecastle/pages/15_Traverse_of_the_Cuillin_Ridge.html"/>

    <!-- Bootstrap -->
        <link rel="stylesheet" href="http://thecastle.github.io/thecastle/theme/css/bootstrap.readable.min.css" type="text/css"/>
    <link href="http://thecastle.github.io/thecastle/theme/css/font-awesome.min.css" rel="stylesheet">
    <link href="http://thecastle.github.io/thecastle/theme/css/pygments.css" rel="stylesheet">
    <link rel="stylesheet" href="http://thecastle.github.io/thecastle/theme/css/style.css" type="text/css"/>
    <!-- JavaScript plugins (requires jQuery) -->


</head>
<body>
<nav class="navbar navbar-default navbar-fixed-top" role="navigation">
    <div class="container">
        <div class="navbar-header">
            <button type="button" class="navbar-toggle" data-toggle="collapse" data-target=".navbar-ex1-collapse">
                <span class="sr-only">Toggle navigation</span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
            </button>
            <a href="http://thecastle.github.io/thecastle" class="navbar-brand">The Castle Mountaineering Club.</a>
        </div>
        <div class="collapse navbar-collapse navbar-ex1-collapse">
            <ul class="nav navbar-nav">
            </ul>
            <ul class="nav navbar-nav navbar-right">
                <li><a href="http://thecastle.github.io/thecastle/archives.html"><i class="icon-th-list"></i>Archives</a></li>
            </ul>
        </div>
        <!-- /.navbar-collapse -->
    </div>
</nav>
<!-- /.navbar -->
<div class="container">
    <div class="row">
        <div class="col-lg-9">
    <section id="content" class="body">

        <div class="entry-content">
            
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Traverse of the Cuillin Ridge</h2>
<div class="outline-text-2" id="text-1">
<div class="export">
<p>
&lt;p&gt;
&lt;em&gt;by Andy Smith&lt;/em&gt;
&lt;/p&gt;
</p>

</div>

<p>
We roused ourselves from our brief but comfortable bivouac
on the  Bealach a&rsquo; Gharbh Choire, the pale dawn heralding a
perfect Skye day.  Way below us to the east we could see that
remote and magical spot  below the fine peak of Sgurr nan Stri
where the River Coruisk flows  into Loch Scavaig. To the south,
the Small Isles   Soay, Canna, Rhum and  Eigg   were visible
across the calm Hebridean sea, with the fascinating  and shapely
peaks of Rhum in particular attracting the attention.
</p>

<p>
It was 3.45 am on Tuesday 27th May 1975, the occasion being
the Club&rsquo;s  Spring Bank Holiday meet to the Black Cuillin, the
party  comprising Ronny Hindmoor, John and Lesley Evans, Sean
Jennings,  Andrew Hothersall, Martin Coggins, Anne Pendlebury and
myself. We had  left Glen Brittle at eight the previous evening
and scrambled  up Sron na Ciche via  Collie&rsquo;s Route , reaching the
top in time to see a  gorgeous sunset. Later we had romped along
the crest of the ridge in  bright moonlight, reaching its
southernmost peak, Gars Bheinn, before  heading back to our
bivouac site. Now, with the stars fading rapidly, we  packed our
sacks and climbed to the top of Sgurr Dubh na Da Bheinn  where,
having warmed ourselves up and reached a superb viewpoint, we
paused for breakfast.
</p>

<p>
Ahead, the jagged crest of the Main Ridge encircled the head of Loch
Coruisk to its final peak and our ultimate objective - Sgurr nan
Gillean a long day&rsquo;s scrambling away but tantalisingly close beyond
the coire. We soon reached the famous Thearlaich Dubh Gap, the first
and most difficult rock pitch of the day. We abseiled into the Gap and
the pitch out of the Gap was well led, the rest of us thrutching up
one way or another &#x00ad; the rock was polished and strenuous and we took
close on an hour to get our party of eight across. We left our sacks
whilst detouring slightly from the Main Ridge to take in Skye&rsquo;s
highest point, the paramount Sgurr Alasdair 3257 ft .
</p>

<p>
The next section, around Coire Lagan, is possibly the
finest stretch of the whole trip: Sgurr Thearlaich, an abseil
down to  Bealach Mhic Coinnich, the surprising Collie&rsquo;s Ledge to
Sgurr Mhic  Coinnich and the magnificent scramble over An Stac
culminating in  the unique Inaccessible Pinnacle. We soloed up
the moderate but very  exposed east ridge of the Pinnacle and
abseiled down the short west face. It was now  11 am and getting
very hot  time for lunch.
</p>

<p>
The ridge becomes sustained, brilliant scrambling:
Banachdich, Thormaid, Ghreadaidh, Mhadaidh, Bidein Druim nan
Ramh, An  Caisteal, Bhairnich, Bruach na Frithe: the roll call of
evocative  Gaelic names familiar to every Skye afficionado. Each
Munro has a  number of tops which all have to be visited, and
even on a clear day,  route finding is not straightforward in
places. It must be very tricky  in mist, compounded by the
occurrence of magnetic rock to confuse the  compass.
</p>

<p>
We were now beginning to get tired and dehydrated. It is
well  known that there is no water on the ridge and we were
carrying large  water bottles, but on such a hot windless day,
our supplies of liquid  had dwindled rapidly. Fortunately there
were still a few snow patches  lingering from the winter to
provide us with a welcome supply of cool  melt water  otherwise
we might well have had to give up.
</p>

<p>
The Bhasteir  Tooth is usually done via  Naismith&rsquo;s Route , an
easy but very exposed  pitch and the last place on the ridge
where a rope is needed.  Unfortunately, when we arrived a large
army party was having a  prolonged abseiling epic on the route,
so we circumnavigated it by  dropping into the Fionn Choire to
the north before tackling Am Basteir itself.
</p>

<p>
We arrived at the final peak, Sgurr nan Gillean, at 7.30 pm,
nearly  eighteen hours  including the bivouac  after leaving Gars
Bheinn, not  a bad time considering the size of the party and the
sweltering  conditions.
</p>

<p>
After staying  together all along the ridge we now split up,
some wanting to  hurry down to the Sligachan Inn to ensure a
pint, the aesthetes preferring to linger and enjoy a perfect
evening in the hills,  chatting, admiring and photographing the
views and consuming the last  remnants of food.
</p>

<p>
At last we reluctantly left the tops and wearily set out
along the seemingly interminable track back to Sligachan,
reaching it just  before 11.00 pm, twenty seven hours after
leaving Glen Brittle: twenty one peaks, many of  them Munros,
fifteen miles of ridge with at least 10,000 feet of ascent and
the roughest, wildest, mountaineering Scotland has to offer. It
was my  longest day out in the British mountains - and the best!
</p>
</div>
</div>

        </div>
    </section>
        </div>
        <div class="col-lg-3 well well-sm" id="sidebar">

<aside>
    <section>

        <ul class="list-group list-group-flush">
             <li class="list-group-item"><h4><i class="icon-search icon-large"></i>Search</h4></li>

                   <li class="list-group-item"><h4><i class="icon-book icon-large"></i>Pages</h4></li>



                <li class="list-group-item"><a href="http://thecastle.github.io/thecastle/tags.html"><h4><i class="icon-tags icon-large"></i>Tags</h4></a></li>
        </ul>
    </section>
</aside>        </div>
    </div>
</div>
<footer>
    <div class="container">
        <hr>
        <p class="pull-right"><i class="icon-arrow-up"></i> <a href="#">Back to top</a></p>


        <p>&copy;  The Castle Mountaineering Club. &middot; Powered by <a href="https://github.com/DandyDev/pelican-bootstrap3" target="_blank">pelican-bootstrap3</a>,
            <a href="http://docs.getpelican.com/" target="_blank">Pelican</a>,
            <a href="http://getbootstrap.com" target="_blank">Bootstrap</a></p>
    </div>
</footer>
<!-- Include all compiled plugins (below), or include individual files as needed -->
<script src="http://thecastle.github.io/thecastle/theme/js/bootstrap.min.js"></script>

<!-- Enable responsive features in IE8 with Respond.js (https://github.com/scottjehl/Respond) -->
<script src="http://thecastle.github.io/thecastle/theme/js/respond.min.js"></script>


</body>
</html>